Repository: Humaneyew/sudoku2
Catalog: lib/l10n/app_*.arb
Languages: ka, ko, uk

# appTitle
source: Sudoku Master
ka: სუდოკუ ოსტატი
ko: 스도쿠 마스터
uk: Судоку Майстер

# navHome
source: Home
ka: მთავარი
ko: 홈
uk: Головна

# navDaily
source: Challenge
ka: გამოწვევა
ko: 도전
uk: Виклик

# navStats
source: Statistics
ka: სტატისტიკა
ko: 통계
uk: Статистика

source: Daily streak
ka: დღიური სერია
ko: 일일 연속
uk: Ланцюг днів

# selectDifficultyTitle
source: Choose difficulty
ka: აირჩიეთ სირთულე
ko: 난이도 선택
uk: Виберіть складність

# selectDifficultyDailyChallenge
source: Daily challenge
ka: გამოწვევა
ko: 일일 도전
uk: Щоденний виклик

# playAction
source: Play
ka: თამაში
ko: 플레이
uk: Грати

# championshipTitle
source: Championship
ka: ჩემპიონატი
ko: 챔피언십
uk: Чемпіонат

# championshipScore
source: Score {score}
ka: ქულები {score}
ko: 점수 {score}
uk: Рахунок {score}

# toNextPlace
source: To next place: {points} pts
ka: შემდეგ ადგილზე გადასასვლელად: {points} ქულა
ko: 다음 순위까지: {points} pts
uk: До наступного місця: {points} оч.

# youAreTop
source: You are #1
ka: თქვენ ხართ #1
ko: 당신은 1위입니다
uk: Ви №1

# championshipRoundDescriptionPlaceholder
source: Play this round to boost your championship run.
ka: ითამაშეთ ეს რაუნდი, რომ გააძლიეროთ თქვენი ჩემპიონატის სერია.
ko: 이 라운드를 플레이해 챔피언십 순위를 끌어올리세요.
uk: Зіграйте в цьому раунді, щоб просунутися в чемпіонаті.

# championshipRoundCompletedLabel
source: Completed
ka: დასრულებულია
ko: 완료
uk: Завершено

# totalScore
source: Total score: {score}
ka: საერთო ქულები: {score}
ko: 총 점수: {score}
uk: Загальний рахунок: {score}

# meLabel
source: Me
ka: მე
ko: 나
uk: Я

# leaderboardRow
source: Place {rank}. {name}. {points} points
ka: ადგილი {rank}. {name}. {points} ქულა
ko: 순위 {rank}. {name}. {points} 포인트
uk: Місце {rank}. {name}. {points} очок

# yourPosition
source: My place {rank}. {points} points
ka: ჩემი ადგილი {rank}. {points} ქულა
ko: 내 순위 {rank}. {points} 포인트
uk: Моє місце {rank}. {points} очок

# pointsShort
source: pts
ka: ქულ.
uk: оч.

# championshipAutoScroll
source: Auto-scroll to my position
ka: ავტომატურად გადახვევა ჩემს პოზიციაზე
ko: 내 위치에 자동 스크롤
uk: Автоскрол до мого місця

# bestLabel
source: Best
ka: საუკეთესო
ko: 최상의
uk: Найкращий результат

source: Play
ka: თამაში
ko: 놀다
uk: Грати

# battleTitle
source: Battle
ka: ბრძოლა
ko: 전투
uk: Битва

# battleWinRate
source: Wins {count}%
ka: მოგებები {count}
ko: 승리 {count}%
uk: Перемог {count}%

# battleYouLabel
source: You
ko: 당신
uk: Ти

# battleVictoryTitle
source: You won!
ko: 당신의 승리!
uk: Ти переміг!

# battleDefeatTitle
source: Opponent finished first
ko: 상대가 승리했어요
uk: Суперник переміг

# battleDefeatMessage
source: {name} solved the puzzle before you.
ko: {name}가 당신보다 먼저 스도쿠를 풀었습니다.
uk: {name} розв'язав головоломку раніше за тебе.

# battleSimpleDefeatTitle
source: You lost
uk: Ви програли

# battleExitToMainMenu
source: Main menu
uk: Головне меню

# playerFlagSettingTitle
source: Player flag
ko: 플레이어 깃발
uk: Прапор гравця

# selectPlayerFlag
source: Choose your flag
ko: 깃발을 선택하세요
uk: Обери свій прапор

# confirmFlagSelectionTitle
source: Confirm your flag
ko: 깃발 확인
uk: Підтвердь свій прапор

# confirmFlagSelectionMessage
source: Are you sure you want to choose this flag? You can change your flag later in the game settings.
ko: 이 깃발을 선택하시겠습니까? 나중에 게임 설정에서 깃발을 변경할 수 있습니다.
uk: Ти впевнений, що хочеш обрати цей прапор? Ти зможеш змінити прапор пізніше в налаштуваннях гри.

# confirmFlagSelectionConfirm
source: Confirm
ko: 확인
uk: Підтверджую

# startAction
source: Start
ka: დაწყება
ko: 시작
uk: Почати

# levelHeading
source: Level {level} — {difficulty}
ka: დონე {level} — {difficulty}
ko: 레벨 {level} — {difficulty}
uk: Рівень {level} — {difficulty}

source: Rank progress
ka: რეიტინგის პროგრესი
ko: 순위 진행
uk: Прогрес рангу

# rankLabel
source: Rank {rank}
ka: რეიტინგი {rank}
ko: 랭크 {rank}
uk: Ранг {rank}

source: New game
ka: ახალი თამაში
ko: 새로운 게임
uk: Нова гра

source: Continue game
ka: გაგრძელება
ko: 계속 게임
uk: Продовжити гру

source: Weekly progress
ka: კვირეული პროგრესი
ko: 주간 진행
uk: Тижневий прогрес

# rewardsTitle
source: Rewards
ka: ჯილდოები
ko: 보상
uk: Нагороди

# rewardNoMistakesTitle
source: Finish the challenge without mistakes
ka: დაასრულეთ გამოწვევა შეცდომების გარეშე
ko: 실수없이 도전을 끝내십시오
uk: Завершіть виклик без помилок

# rewardExtraHearts
source: +{count, plural, one {# heart} other {# hearts}}
ka: +{count, plural, one {# გული} other {# გული}}
ko: +{count, plural, one {# 하트} other {# 하트}}
uk: +{count, plural, one {# серце} few {# серця} many {# сердець} other {# серця}}

# rewardThreeInRowTitle
source: Complete three challenges in a row
ka: დაასრულეთ სამი გამოწვევა ზედიზედ
ko: 연속으로 세 가지 도전을 완료하십시오
uk: Виконайте три виклики поспіль

# rewardUniqueTrophy
source: Unique trophy
ka: უნიკალური თასი
ko: 독특한 트로피
uk: Унікальний трофей

# rewardSevenDayTitle
source: Maintain a 7-day streak
ka: შეინარჩუნეთ 7-დღიანი სერია
ko: 7 일 행진을 유지하십시오
uk: Підтримуйте серію 7 днів

# rewardStars
source: +{count, plural, one {# star} other {# stars}}
ka: +{count, plural, one {# ვარსკვლავი} other {# ვარსკვლავი}}
ko: +{count, plural, one {# 별} other {# 별}}
uk: +{count, plural, one {# зірка} few {# зірки} many {# зірок} other {# зірки}}

# todayPuzzle
source: Today's puzzle
ka: დღევანდელი თავსატეხი
ko: 오늘의 퍼즐
uk: Сьогоднішня головоломка

# todayPuzzleDescription
source: Finish the sudoku to earn an extra reward and keep your streak alive.
ka: დაასრულეთ სუდოკუ, რათა მიიღოთ დამატებითი ჯილდო და შეინარჩუნოთ სერია.
ko: 스도쿠를 마치고 추가 보상을 받고 줄무늬를 유지하십시오.
uk: Завершіть судоку, щоб отримати додаткову нагороду та продовжити серію.

# continueAction
source: Continue
ka: გაგრძელება
ko: 계속하다
uk: Продовжити

# adMessage
source: Ad: Find hidden objects! Play now.
ka: რეკლამა: იპოვეთ დამალული ობიექტები! ითამაშეთ ახლავე.
ko: AD : 숨겨진 물건을 찾으십시오! 지금 플레이하십시오.
uk: Реклама: Знайди приховані об'єкти! Грай зараз.

# adPlay
source: Play
ka: თამაში
ko: 놀다
uk: Грати

source: Undo
ka: გაუქმება
ko: 끄르다
uk: Скасувати

source: Erase
ka: წაშლა
ko: 지우다
uk: Стерти

source: Auto notes
ka: ავტო შენიშვნები
ko: 자동 노트
uk: Автоматичні нотатки

# statusOn
source: ON
ka: ჩართული
ko: 에
uk: УВІМК

# statusOff
source: OFF
ka: გამორთული
ko: 끄다
uk: ВИМК

source: Notes
ka: შენიშვნები
ko: 메모
uk: Нотатки

source: Hint
ka: მინიშნება
ko: 힌트
uk: Підказка

# undoAdTitle
source: Watch ad to undo
ka: უყურეთ რეკლამას გასაუქმებლად
ko: 취소 할 광고를 시청하십시오
uk: Перегляд реклами для скасування

# undoAdDescription
source: Watch this short ad to undo your last move.
ka: უყურეთ ამ მოკლე რეკლამას, რომ გააუქმოთ ბოლო სვლა.
ko: 이 짧은 광고를보고 마지막 이동을 취소하십시오.
uk: Перегляньте коротку рекламу, щоб скасувати останній хід.

# undoAdCountdown
source: Ad ends in {seconds}s
ka: რეკლამა დასრულდება {seconds} წმ-ში
ko: 광고가 {seconds}초 후 종료
uk: Реклама завершиться через {seconds} с

# hintAdTitle
source: Watch ad to get a hint
ko: 힌트를 얻으려면 광고를 시청하세요
uk: Перегляньте рекламу, щоб отримати підказку

# hintAdDescription
source: Watch this short ad to earn a hint.
ko: 짧은 광고를 시청하고 힌트를 얻으세요.
uk: Перегляньте коротку рекламу, щоб отримати підказку.

# hintAdCountdown
source: Ad ends in {seconds}s
ko: 광고가 {seconds}초 후 종료
uk: Реклама завершиться через {seconds} с

# lifeAdTitle
source: Watch ad to restore a heart
uk: Перегляньте рекламу, щоб відновити серце

# lifeAdDescription
source: Watch this short ad to restore a red heart and keep playing.
uk: Перегляньте коротку рекламу, щоб відновити червоне серце й продовжити гру.

# lifeAdCountdown
source: Ad ends in {seconds}s
uk: Реклама завершиться через {seconds} с

# gameScreenTitle
source: Sudoku
ka: სუდოკუ
ko: 스도쿠
uk: Судоку

# noActiveGameMessage
source: No active game. Return to the home screen.
ka: აქტიური თამაში არ არის. დაბრუნდით მთავარ ეკრანზე.
ko: 능동적 인 게임이 없습니다. 홈 화면으로 돌아갑니다.
uk: Немає активної гри. Поверніться на головний екран.

# victoryTitle
source: Congratulations!
ka: გილოცავთ!
ko: 축하해요!
uk: Вітаємо!

# victoryMessage
source: Puzzle solved in {time}.
ka: თავსატეხი ამოხსნილია {time}-ში.
ko: 퍼즐을 {time}에 해결했습니다.
uk: Головоломку розв'язано за {time}.

# backToHome
source: Home
ka: მთავარი
ko: 집
uk: На головну

# playAnother
source: Play again
ka: კიდევ თამაში
ko: 다시 플레이하십시오
uk: Ще одну

# outOfLivesTitle
source: You're out of hearts
ka: გულები აღარ დარჩა
ko: 당신은 마음이 없습니다
uk: Ви втратили всі серця

# outOfLivesDescription
source: Restore one red heart to keep playing.
ka: თამაშის გასაგრძელებლად აღადგინეთ ერთი წითელი გული.
ko: 붉은 심장 하나를 회복하여 계속 연주하십시오.
uk: Відновіть одне червоне серце, щоб продовжити гру.

# restoreLifeAction
source: Restore 1 red heart
ka: 1 წითელი გულის აღდგენა
ko: 1 개의 붉은 심장을 복원하십시오
uk: Відновити 1 червоне серце

# cancelAction
source: Cancel
ka: გაუქმება
ko: 취소
uk: Скасувати

# settingsTitle
source: Settings
ka: პარამეტრები
ko: 설정
uk: Налаштування

# themeSectionTitle
source: Theme
ka: თემა
ko: 주제
uk: Тема

# themeWhite
source: Classic Light
ka: კლასიკური ღია
ko: 클래식 라이트
uk: Класична світла

# themeCream
source: Cream
ka: კრემისფერი
ko: 크림
uk: Кремова

# themeGreen
source: Mint
ka: მინტი
ko: 박하
uk: М'ятна

# themeBlack
source: Dark
ka: მუქი
ko: 어두운
uk: Темна

# themePurple
source: Purple Dark
ka: იისფერი მუქი
ko: 보라색 어두운
uk: Фіолетова темна

# themeFontSize
source: Font size
ka: ფონტის ზომა
ko: 글꼴 크기
uk: Розмір шрифту

# fontSizeExtraSmall
source: Extra small
ka: ძალიან პატარა
ko: 더 작습니다
uk: Дуже малий

# fontSizeSmall
source: Small
ka: პატარა
ko: 작은
uk: Малий

# fontSizeMedium
source: Medium
ka: საშუალო
ko: 중간
uk: Середній

# fontSizeLarge
source: Large
ka: დიდი
ko: 크기가 큰
uk: Великий

# fontSizeExtraLarge
source: Extra large
ka: ძალიან დიდი
ko: 특대
uk: Дуже великий

# languageSectionTitle
source: Language
ka: ენა
ko: 언어
uk: Мова

# audioSectionTitle
source: Sound & music
ka: ხმა და მუსიკა
ko: 소리와 음악
uk: Звуки та музика

# soundsEffectsLabel
source: Sound effects
ka: ხმის ეფექტები
ko: 음향 효과
uk: Звукові ефекти

# vibrationLabel
source: Vibration
ka: ვიბრაცია
ko: 진동
uk: Вібрація

# miscSectionTitle
source: Other
ka: სხვა
ko: 다른
uk: Інше

# howToPlayTitle
source: How to play
uk: Як грати

# howToPlayRowRule
source: Each row has the digits 1 to 9 with no repeats
uk: У кожному рядку цифри від 1 до 9 без повторів

# howToPlayColumnRule
source: Each column has the digits 1 to 9 with no repeats
uk: У кожній колонці цифри від 1 до 9 без повторів

# howToPlayBoxRule
source: Each 3×3 box has the digits 1 to 9 with no repeats
uk: У кожному квадраті 3×3 цифри від 1 до 9 без повторів

# howToPlayFooter
source: Fill every cell and you win!
uk: Заповни всі клітинки — і переможи!

# howToPlayAction
source: Got it
uk: Зрозуміло

# championshipLocalSection
source: Championship (local)
ka: ჩემპიონატი (ლოკალური)
ko: 챔피언십 (지역)
uk: Чемпіонат (локально)

# hideCompletedNumbersLabel
source: Hide completed digits
ka: დამალე დასრულებული ციფრები
ko: 완성 된 숫자를 숨기십시오
uk: Прибирати використані цифри

# aboutApp
source: About
ka: აპლიკაციის შესახებ
ko: 에 대한
uk: Про застосунок

# versionLabel
source: Version {version}
ka: ვერსია {version}
ko: 버전 {version}
uk: Версія {version}

source: Export
ka: ექსპორტი
ko: 내보내다
uk: Експорт

source: Import
ka: იმპორტი
ko: 수입
uk: Імпорт

source: Reset my score
ka: ჩემი ქულების განულება
ko: 내 점수를 재설정하십시오
uk: Скинути мій рахунок

# resetMyScoreConfirmation
source: Are you sure you want to reset the score? This action cannot be undone.
ka: დარწმუნებული ხართ, რომ გსურთ ქულების განულება? ეს ქმედება შეუქცევადია.
ko: 점수를 재설정 하시겠습니까? 이 조치는 취소 할 수 없습니다.
uk: Ви впевнені, що хочете скинути рахунок? Цю дію неможливо скасувати.

# resetAction
source: Reset
ka: განულება
ko: 다시 놓기
uk: Скинути

source: Regenerate opponents
ka: მოწინააღმდეგეების განახლება
ko: 상대방을 재생합니다
uk: Перегенерувати суперників

source: Confirm
ka: დადასტურება
ko: 확인하다
uk: Підтвердити

source: Cancel
ka: გაუქმება
ko: 취소
uk: Скасувати

source: Done
ka: დასრულდა
ko: 완료
uk: Готово

# privacyPolicyTitle
source: Privacy Policy
uk: Політика конфіденційності

# privacyPolicyAccept
source: I accept
uk: Приймаю

# privacyPolicyPrompt
source: Do you accept the Privacy Policy?
uk: Ви приймаєте Політику конфіденційності?

# privacyPolicyLearnMore
source: Learn more →
uk: Детальніше →

# privacyPolicyDecline
source: I decline
uk: Відхиляю

# privacyPolicyClose
source: Close
uk: Закрити

# privacyPolicyLoadError
source: Failed to load privacy policy. Please try again.
uk: Не вдалося завантажити політику конфіденційності. Спробуйте ще раз.

source: Failed
ka: ვერ შესრულდა
ko: 실패한
uk: Помилка

# rankBadgeChasing
source: Rank #{current} • +{delta} to #{target}
ka: რეიტინგი #{current} • +{delta} რათა მიაღწიოთ #{target}
ko: 랭크 #{current} • +{delta} #{target}까지
uk: Місце #{current} • +{delta} до #{target}

# statsTitle
source: Statistics
ka: სტატისტიკა
ko: 통계
uk: Статистика

# statsGamesSection
source: Games
ka: თამაშები
ko: 계략
uk: Ігри

# statsGamesStarted
source: Games started
ka: დაწყებული თამაშები
ko: 게임이 시작되었습니다
uk: Розпочаті ігри

# statsGamesWon
source: Games won
ka: მოგებული თამაშები
ko: 게임 우승
uk: Виграні ігри

# statsWinRate
source: Win rate
ka: მოგების მაჩვენებელი
ko: 승리
uk: Відсоток перемог

# statsFlawless
source: Flawless finishes
ka: სრულყოფილი დასრულებები
ko: 완벽한 마무리
uk: Безпомилкові завершення

# statsTimeSection
source: Time
ka: დრო
ko: 시간
uk: Час

# statsBestTime
source: Best time
ka: საუკეთესო დრო
ko: 최고의 시간
uk: Найкращий час

# statsAverageTime
source: Average time
ka: საშუალო დრო
ko: 평균 시간
uk: Середній час

# statsStreakSection
source: Streak
ka: სერია
ko: 줄
uk: Серія

# statsCurrentStreak
source: Current streak
ka: მიმდინარე სერია
ko: 현재 행진
uk: Поточна серія

# statsBestStreak
source: Best streak
ka: საუკეთესო სერია
ko: 최고의 행진
uk: Найкраща серія

# difficultyNovice
source: Novice
ka: დამწყები
ko: 초심자
uk: Новачок

# difficultyNoviceShort
source: Nov.
ka: დამ.
ko: 11 월
uk: Нов.

# difficultyMedium
source: Intermediate
ka: საშუალო
ko: 중간
uk: Середній

# difficultyMediumShort
source: Int.
ka: საშ.
uk: Сер.

# difficultyHigh
source: Advanced
ka: გამოცდილი
ko: 고급의
uk: Високий

# difficultyHighShort
source: Adv.
ka: გამოც.
uk: Вис.

# difficultyExpert
source: Expert
ka: ექსპერტი
ko: 전문가
uk: Експерт

# difficultyExpertShort
source: Exp.
ka: ექსპ.
uk: Експ.

# difficultyMaster
source: Master
ka: ოსტატი
ko: 주인
uk: Майстр

# difficultyMasterShort
source: Mst.
ka: ოსტ.
uk: Майстр.

# aboutLegalese
source: Nahreba UZOR Inc.
ka: © 2025 Sudoku Inc.
